### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-main"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>